app/controllers/subscription_controller.rb

INSERT INTO `subscriptions` (`created_at`, `email`, `paypal_customer_token`, `paypal_recurring_profile_token`, `updated_at`) VALUES ('2012-10-17 19:54:55', 'buyer_1350407340_per@gmail.com', 'Z4PSS978ZM6YG', 'I-33EYDED9NH1X', '2012-10-17 19:54:55')
---
  def create
  	@subscription = Subscription.new(params[:subscription])
  	if @subscription.save_with_payment

SELECT `subscriptions`.* FROM `subscriptions` WHERE `subscriptions`.`id` = 1 LIMIT 1
---
  def show
  	@subscription = Subscription.find(params[:id])